-- phpMyAdmin SQL Dump
-- version 4.8.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 06, 2019 at 10:16 PM
-- Server version: 10.1.32-MariaDB
-- PHP Version: 7.2.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `myprojectphp`
--

-- --------------------------------------------------------

--
-- Table structure for table `notiline`
--

CREATE TABLE `notiline` (
  `id` int(11) NOT NULL,
  `sensor` double(6,2) NOT NULL,
  `status_water` varchar(50) NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `notiline`
--

INSERT INTO `notiline` (`id`, `sensor`, `status_water`, `date`, `time`) VALUES
(459, 8.00, 'ระดับสูงขึ้น', '2019-01-17', '17:07:00'),
(485, 0.00, '$message', '2019-01-18', '22:54:03'),
(486, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:25'),
(487, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:28'),
(488, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:34'),
(489, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:36'),
(490, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:36'),
(491, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:40'),
(492, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:46'),
(493, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:46'),
(494, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:53'),
(495, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:57'),
(496, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:13:59'),
(497, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:05'),
(498, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:08'),
(499, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:11'),
(500, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:17'),
(501, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:19'),
(502, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:24'),
(503, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:30'),
(504, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:30'),
(505, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:36'),
(506, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:41'),
(507, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:42'),
(508, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:48'),
(509, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:14:54'),
(510, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:15:00'),
(511, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:15:51'),
(512, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:15:57'),
(513, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:03'),
(514, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:10'),
(515, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:16'),
(516, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:22'),
(517, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:28'),
(518, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:34'),
(519, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:41'),
(520, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:47'),
(521, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:16:53'),
(522, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:17:00'),
(523, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:17:06'),
(524, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:17:13'),
(525, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:17:19'),
(526, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:17:25'),
(527, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:17:32'),
(528, 3.00, 'ระดับสูงขึ้น', '2019-01-18', '23:17:38'),
(529, 4.00, 'ระดับสูงขึ้น', '2019-01-19', '00:06:36'),
(530, 4.00, 'ระดับสูงขึ้น', '2019-01-19', '00:06:42'),
(531, 63.00, 'ระดับสูงขึ้น', '2019-01-19', '00:06:48'),
(532, 61.00, 'ระดับสูงขึ้น', '2019-01-19', '00:06:55'),
(533, 62.00, 'ระดับสูงขึ้น', '2019-01-19', '00:07:01'),
(534, 128.00, 'ระดับสูงขึ้น', '2019-01-19', '00:07:14'),
(535, 142.00, 'ระดับสูงขึ้น', '2019-01-19', '00:07:33'),
(536, 20.00, 'ระดับสูงขึ้น', '2019-01-19', '00:07:39'),
(537, 138.00, 'ระดับสูงขึ้น', '2019-01-19', '00:08:04');

-- --------------------------------------------------------

--
-- Table structure for table `process_statuses`
--

CREATE TABLE `process_statuses` (
  `id` int(10) UNSIGNED NOT NULL,
  `idUsers` int(10) UNSIGNED DEFAULT NULL,
  `idPumps` int(10) UNSIGNED NOT NULL,
  `idStatus` int(10) UNSIGNED NOT NULL,
  `idWaters` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `pumps`
--

CREATE TABLE `pumps` (
  `id` int(10) UNSIGNED NOT NULL,
  `address` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `pumps`
--

INSERT INTO `pumps` (`id`, `address`) VALUES
(1, 'สวนมะนาว');

-- --------------------------------------------------------

--
-- Table structure for table `statuses`
--

CREATE TABLE `statuses` (
  `id` int(10) UNSIGNED NOT NULL,
  `numstatus` int(11) NOT NULL DEFAULT '0',
  `detail` varchar(5) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL,
  `idUser` int(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `statuses`
--

INSERT INTO `statuses` (`id`, `numstatus`, `detail`, `date`, `time`, `idUser`) VALUES
(184, 1, 'เปิด', '2019-02-07', '02:06:48', 63),
(185, 1, 'เปิด', '2019-02-07', '02:08:20', 63),
(186, 1, 'เปิด', '2019-02-07', '02:10:48', 63),
(187, 1, 'เปิด', '2019-02-07', '02:10:50', 63),
(188, 1, 'เปิด', '2019-02-07', '02:11:22', 63),
(189, 0, 'ปิด', '2019-02-07', '02:11:47', 63),
(190, 0, 'ปิด', '2019-02-07', '02:11:54', 63),
(191, 1, 'เปิด', '2019-02-07', '02:15:00', 63),
(192, 1, 'เปิด', '2019-02-07', '02:17:59', 63),
(193, 1, 'เปิด', '2019-02-07', '02:21:52', 63),
(194, 1, 'เปิด', '2019-02-07', '02:25:59', 63),
(195, 1, 'เปิด', '2019-02-07', '02:26:56', 63),
(196, 1, 'เปิด', '2019-02-07', '02:27:40', 63),
(222, 0, 'ปิด', '2019-02-07', '03:54:17', 0),
(223, 0, 'ปิด', '2019-02-07', '03:54:46', 63),
(224, 0, 'ปิด', '2019-02-07', '03:55:21', 63),
(225, 0, 'ปิด', '2019-02-07', '03:57:14', 63);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `lastname` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `api_token` varchar(60) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `isadmin` int(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `email`, `password`, `name`, `lastname`, `api_token`, `isadmin`, `created_at`, `updated_at`) VALUES
(1, 'fdf@hotmail.com', '$2y$10$eR3qI5nAWoHjD.y0GjoiM.upgZC9X43kgXQwoySm/wAi8qhGDmwWS', 'tyyyyyy', 'ytytyt', NULL, 1, NULL, NULL),
(48, 'u@hotmail.com', '81dc9bdb52d04dc20036dbd8313ed055', 'sd', 'sdfs', NULL, 2, '2019-01-28 16:26:28', '2019-02-04 06:39:11'),
(63, 'admin@hotmail.com', 'YWRtaW4=', 'asd', 'asd', NULL, 1, '2019-02-06 12:13:14', '2019-02-06 20:58:27');

-- --------------------------------------------------------

--
-- Table structure for table `user_activities`
--

CREATE TABLE `user_activities` (
  `id` int(10) UNSIGNED NOT NULL,
  `value` int(11) NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL,
  `idUsers` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `user_activities`
--

INSERT INTO `user_activities` (`id`, `value`, `date`, `time`, `idUsers`) VALUES
(15, 150, '2019-01-17', '18:17:25', 1),
(16, 178, '2019-01-17', '18:18:06', 1),
(17, 130, '2019-01-17', '18:18:41', 1),
(18, 100, '2019-01-18', '23:27:14', 1),
(19, 20, '2019-01-19', '11:34:15', 1),
(20, 100, '2019-02-07', '01:04:10', 1);

-- --------------------------------------------------------

--
-- Table structure for table `waters`
--

CREATE TABLE `waters` (
  `id` int(10) UNSIGNED NOT NULL,
  `waterLevel` double(5,2) NOT NULL,
  `sensor_duration` double(8,2) NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `waters`
--

INSERT INTO `waters` (`id`, `waterLevel`, `sensor_duration`, `date`, `time`) VALUES
(960, 192.00, 8.00, '2019-01-17', '17:02:17'),
(961, 192.00, 8.00, '2019-01-17', '17:02:30'),
(962, 192.00, 8.00, '2019-01-17', '17:02:54'),
(963, 192.00, 8.00, '2019-01-17', '17:03:04'),
(964, 192.00, 8.00, '2019-01-17', '17:03:14'),
(965, 192.00, 8.00, '2019-01-17', '17:03:35'),
(966, 192.00, 8.00, '2019-01-17', '17:03:45'),
(967, 192.00, 8.00, '2019-01-17', '17:03:56'),
(1068, 133.00, 67.00, '2019-01-18', '22:27:52'),
(1069, 134.00, 66.00, '2019-01-18', '22:27:58'),
(1071, 168.00, 32.00, '2019-01-18', '22:44:13'),
(1072, 186.00, 14.00, '2019-01-18', '22:44:19'),
(1073, 186.00, 14.00, '2019-01-18', '22:44:26'),
(1074, 186.00, 14.00, '2019-01-18', '22:44:32'),
(1075, 186.00, 14.00, '2019-01-18', '22:44:38'),
(1076, 192.00, 8.00, '2019-01-18', '22:44:44'),
(1077, 192.00, 8.00, '2019-01-18', '22:44:51'),
(1078, 192.00, 8.00, '2019-01-18', '22:45:49'),
(1079, 192.00, 8.00, '2019-01-18', '22:45:55'),
(1080, 192.00, 8.00, '2019-01-18', '22:46:02'),
(1081, 192.00, 8.00, '2019-01-18', '22:46:08'),
(1082, 192.00, 8.00, '2019-01-18', '22:46:14'),
(1083, 192.00, 8.00, '2019-01-18', '22:46:20'),
(1084, 192.00, 8.00, '2019-01-18', '22:46:27'),
(1085, 193.00, 7.00, '2019-01-18', '22:46:33'),
(1086, 193.00, 7.00, '2019-01-18', '22:46:42'),
(1087, 193.00, 7.00, '2019-01-18', '22:46:48'),
(1088, 193.00, 7.00, '2019-01-18', '22:46:54'),
(1089, 193.00, 7.00, '2019-01-18', '22:47:01'),
(1090, 193.00, 7.00, '2019-01-18', '22:47:07'),
(1091, 193.00, 7.00, '2019-01-18', '22:47:14'),
(1092, 193.00, 7.00, '2019-01-18', '22:47:20'),
(1093, 193.00, 7.00, '2019-01-18', '22:47:26'),
(1094, 193.00, 7.00, '2019-01-18', '22:47:32'),
(1095, 193.00, 7.00, '2019-01-18', '22:47:38'),
(1096, 193.00, 7.00, '2019-01-18', '22:47:45'),
(1097, 193.00, 7.00, '2019-01-18', '22:47:51'),
(1098, 193.00, 7.00, '2019-01-18', '22:47:57'),
(1099, 192.00, 8.00, '2019-01-18', '22:48:03'),
(1100, 193.00, 7.00, '2019-01-18', '22:48:10'),
(1101, 193.00, 7.00, '2019-01-18', '22:48:16'),
(1102, 193.00, 7.00, '2019-01-18', '22:48:22'),
(1103, 193.00, 7.00, '2019-01-18', '22:48:28'),
(1104, 192.00, 8.00, '2019-01-18', '22:48:35'),
(1105, 193.00, 7.00, '2019-01-18', '22:48:41'),
(1106, 193.00, 7.00, '2019-01-18', '22:48:47'),
(1107, 193.00, 7.00, '2019-01-18', '22:48:53'),
(1108, 193.00, 7.00, '2019-01-18', '22:49:00'),
(1109, 193.00, 7.00, '2019-01-18', '22:49:06'),
(1110, 193.00, 7.00, '2019-01-18', '22:49:12'),
(1111, 193.00, 7.00, '2019-01-18', '22:49:19'),
(1112, 193.00, 7.00, '2019-01-18', '22:49:25'),
(1113, 193.00, 7.00, '2019-01-18', '22:49:32'),
(1114, 193.00, 7.00, '2019-01-18', '22:49:38'),
(1115, 193.00, 7.00, '2019-01-18', '22:49:44'),
(1116, 193.00, 7.00, '2019-01-18', '22:49:51'),
(1117, 193.00, 7.00, '2019-01-18', '22:49:56'),
(1118, 193.00, 7.00, '2019-01-18', '22:50:06'),
(1119, 193.00, 7.00, '2019-01-18', '22:50:12'),
(1120, 193.00, 7.00, '2019-01-18', '22:50:18'),
(1121, 195.00, 5.00, '2019-01-18', '22:56:12'),
(1122, 196.00, 4.00, '2019-01-18', '22:56:18'),
(1123, 196.00, 4.00, '2019-01-18', '22:56:24'),
(1124, 196.00, 4.00, '2019-01-18', '22:56:30'),
(1125, 196.00, 4.00, '2019-01-18', '22:56:36'),
(1126, 196.00, 4.00, '2019-01-18', '22:56:42'),
(1127, 195.00, 5.00, '2019-01-18', '22:56:49'),
(1128, 196.00, 4.00, '2019-01-18', '22:56:55'),
(1129, 196.00, 4.00, '2019-01-18', '22:57:01'),
(1130, 196.00, 4.00, '2019-01-18', '22:57:07'),
(1131, 196.00, 4.00, '2019-01-18', '22:57:13'),
(1132, 196.00, 4.00, '2019-01-18', '22:57:19'),
(1133, 196.00, 4.00, '2019-01-18', '22:57:26'),
(1134, 196.00, 4.00, '2019-01-18', '22:57:32'),
(1135, 195.00, 5.00, '2019-01-18', '22:57:39'),
(1136, 196.00, 4.00, '2019-01-18', '22:58:34'),
(1137, 196.00, 4.00, '2019-01-18', '22:58:40'),
(1138, 196.00, 4.00, '2019-01-18', '22:58:47'),
(1139, 196.00, 4.00, '2019-01-18', '22:58:53'),
(1140, 196.00, 4.00, '2019-01-18', '22:58:59'),
(1141, 196.00, 4.00, '2019-01-18', '22:59:05'),
(1142, 196.00, 4.00, '2019-01-18', '22:59:12'),
(1143, 196.00, 4.00, '2019-01-18', '22:59:17'),
(1144, 196.00, 4.00, '2019-01-18', '22:59:23'),
(1145, 196.00, 4.00, '2019-01-18', '22:59:30'),
(1146, 196.00, 4.00, '2019-01-18', '22:59:36'),
(1147, 195.00, 5.00, '2019-01-18', '22:59:43'),
(1148, 196.00, 4.00, '2019-01-18', '22:59:49'),
(1149, 196.00, 4.00, '2019-01-18', '22:59:55'),
(1150, 195.00, 5.00, '2019-01-18', '23:00:01'),
(1151, 196.00, 4.00, '2019-01-18', '23:00:08'),
(1152, 196.00, 4.00, '2019-01-18', '23:00:14'),
(1153, 196.00, 4.00, '2019-01-18', '23:00:21'),
(1154, 195.00, 5.00, '2019-01-18', '23:00:27'),
(1155, 196.00, 4.00, '2019-01-18', '23:00:33'),
(1156, 196.00, 4.00, '2019-01-18', '23:00:39'),
(1157, 197.00, 3.00, '2019-01-18', '23:06:48'),
(1158, 197.00, 3.00, '2019-01-18', '23:06:54'),
(1159, 197.00, 3.00, '2019-01-18', '23:07:03'),
(1160, 197.00, 3.00, '2019-01-18', '23:07:09'),
(1161, 197.00, 3.00, '2019-01-18', '23:07:19'),
(1162, 197.00, 3.00, '2019-01-18', '23:07:25'),
(1163, 197.00, 3.00, '2019-01-18', '23:07:31'),
(1164, 197.00, 3.00, '2019-01-18', '23:07:37'),
(1165, 197.00, 3.00, '2019-01-18', '23:07:43'),
(1166, 197.00, 3.00, '2019-01-18', '23:07:49'),
(1167, 197.00, 3.00, '2019-01-18', '23:07:55'),
(1168, 197.00, 3.00, '2019-01-18', '23:08:01'),
(1169, 197.00, 3.00, '2019-01-18', '23:08:07'),
(1170, 197.00, 3.00, '2019-01-18', '23:08:14'),
(1171, 197.00, 3.00, '2019-01-18', '23:08:19'),
(1172, 197.00, 3.00, '2019-01-18', '23:08:26'),
(1173, 197.00, 3.00, '2019-01-18', '23:08:32'),
(1174, 197.00, 3.00, '2019-01-18', '23:08:38'),
(1175, 197.00, 3.00, '2019-01-18', '23:08:45'),
(1176, 197.00, 3.00, '2019-01-18', '23:08:51'),
(1177, 197.00, 3.00, '2019-01-18', '23:08:57'),
(1178, 197.00, 3.00, '2019-01-18', '23:09:03'),
(1179, 197.00, 3.00, '2019-01-18', '23:09:09'),
(1180, 197.00, 3.00, '2019-01-18', '23:09:15'),
(1181, 197.00, 3.00, '2019-01-18', '23:15:51'),
(1182, 197.00, 3.00, '2019-01-18', '23:15:57'),
(1183, 197.00, 3.00, '2019-01-18', '23:16:04'),
(1184, 197.00, 3.00, '2019-01-18', '23:16:10'),
(1185, 197.00, 3.00, '2019-01-18', '23:16:16'),
(1186, 197.00, 3.00, '2019-01-18', '23:16:22'),
(1187, 197.00, 3.00, '2019-01-18', '23:16:28'),
(1188, 197.00, 3.00, '2019-01-18', '23:16:35'),
(1189, 197.00, 3.00, '2019-01-18', '23:16:41'),
(1190, 197.00, 3.00, '2019-01-18', '23:16:47'),
(1191, 197.00, 3.00, '2019-01-18', '23:16:54'),
(1192, 197.00, 3.00, '2019-01-18', '23:17:00'),
(1193, 197.00, 3.00, '2019-01-18', '23:17:07'),
(1194, 197.00, 3.00, '2019-01-18', '23:17:13'),
(1195, 197.00, 3.00, '2019-01-18', '23:17:19'),
(1196, 197.00, 3.00, '2019-01-18', '23:17:25'),
(1197, 197.00, 3.00, '2019-01-18', '23:17:32'),
(1198, 197.00, 3.00, '2019-01-18', '23:17:38'),
(1199, 196.00, 4.00, '2019-01-19', '00:06:36'),
(1200, 197.00, 3.00, '2019-01-19', '00:06:42'),
(1201, 138.00, 62.00, '2019-01-19', '00:06:48'),
(1202, 138.00, 62.00, '2019-01-19', '00:06:55'),
(1203, 0.00, 507.00, '2019-01-19', '00:07:01'),
(1204, 72.00, 128.00, '2019-01-19', '00:07:07'),
(1205, 41.00, 159.00, '2019-01-19', '00:07:14'),
(1206, 50.00, 150.00, '2019-01-19', '00:07:20'),
(1207, 87.00, 113.00, '2019-01-19', '00:07:27'),
(1208, 40.00, 160.00, '2019-01-19', '00:07:33'),
(1209, 45.00, 155.00, '2019-01-19', '00:07:39'),
(1210, 47.00, 153.00, '2019-01-19', '00:07:46'),
(1211, 48.00, 152.00, '2019-01-19', '00:07:52'),
(1212, 79.00, 121.00, '2019-01-19', '00:07:58'),
(1213, 0.00, 1473.00, '2019-01-19', '00:08:04'),
(1214, 0.00, 384.00, '2019-01-19', '00:08:11'),
(1215, 122.00, 78.00, '2019-01-19', '00:08:17'),
(1216, 187.00, 13.00, '2019-02-04', '04:09:04'),
(1217, 186.00, 14.00, '2019-02-04', '04:09:08'),
(1218, 134.00, 66.00, '2019-02-04', '04:14:39'),
(1219, 140.00, 60.00, '2019-02-04', '04:15:41'),
(1220, 140.00, 60.00, '2019-02-04', '04:16:42'),
(1221, 193.00, 7.00, '2019-02-04', '04:16:45');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `notiline`
--
ALTER TABLE `notiline`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `process_statuses`
--
ALTER TABLE `process_statuses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `process_statuses_idusers_foreign` (`idUsers`),
  ADD KEY `process_statuses_idpumps_foreign` (`idPumps`),
  ADD KEY `process_statuses_idstatus_foreign` (`idStatus`),
  ADD KEY `process_statuses_idwaters_foreign` (`idWaters`);

--
-- Indexes for table `pumps`
--
ALTER TABLE `pumps`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `statuses`
--
ALTER TABLE `statuses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_api_token_unique` (`api_token`);

--
-- Indexes for table `user_activities`
--
ALTER TABLE `user_activities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_activities_idusers_foreign` (`idUsers`);

--
-- Indexes for table `waters`
--
ALTER TABLE `waters`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `notiline`
--
ALTER TABLE `notiline`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=538;

--
-- AUTO_INCREMENT for table `process_statuses`
--
ALTER TABLE `process_statuses`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pumps`
--
ALTER TABLE `pumps`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `statuses`
--
ALTER TABLE `statuses`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=226;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT for table `user_activities`
--
ALTER TABLE `user_activities`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `waters`
--
ALTER TABLE `waters`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1222;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `process_statuses`
--
ALTER TABLE `process_statuses`
  ADD CONSTRAINT `process_statuses_idpumps_foreign` FOREIGN KEY (`idPumps`) REFERENCES `pumps` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `process_statuses_idstatus_foreign` FOREIGN KEY (`idStatus`) REFERENCES `statuses` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `process_statuses_idusers_foreign` FOREIGN KEY (`idUsers`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `process_statuses_idwaters_foreign` FOREIGN KEY (`idWaters`) REFERENCES `waters` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `user_activities`
--
ALTER TABLE `user_activities`
  ADD CONSTRAINT `user_activities_idusers_foreign` FOREIGN KEY (`idUsers`) REFERENCES `users` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
